9 projects rubymine/RubyOnRails_Testing3/app/views/parents/show.html.erb

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`parent_id` = 21
---
<%# listing nested data %>
<% @parent.blogs.each do |blog| %>