9 projects rubymine/RubyOnRails_Testing3/app/controllers/authors_controller.rb

INSERT INTO `authors` (`author_name`, `author_number`, `created_at`, `updated_at`) VALUES ('jhj', 7, '2019-09-22 11:19:56.663291', '2019-09-22 11:19:56.663291')
---
  def create
    @author = Author.new(author_params)
    respond_to do |format|
      if @author.save

UPDATE `authors` SET `authors`.`author_name` = 'author name 2j', `authors`.`author_number` = 7, `authors`.`updated_at` = '2019-09-22 11:18:56.696959' WHERE `authors`.`id` = 3
---
  def update
    respond_to do |format|
      if @author.update(author_params)

DELETE FROM `authors` WHERE `authors`.`id` = 7
---
  def destroy
    @author.destroy

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 3 LIMIT 1
---
  def set_author
    @author = Author.find(params[:id])