9 projects rubymine/RubyOnRails_Testing3/app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs` ORDER BY `blogs`.`id` DESC LIMIT 1
---
  def index
    # calling model and putting in instance variable
    # (making data available to the matching view page)
    @blogs = Blog.all

SELECT `blogs`.* FROM `blogs` ORDER BY `blogs`.`id` DESC LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`blog_name` = 'random name'
---
    # pry()> continue

    # alternatively in non exists returns nil instead of error
    @blogs2 = Blog.all&

    # alternatively pass parameter directly
    @blogs3 = Blog.where(blog_name: 'random name')

INSERT INTO `blogs` (`blog_name`, `blog_number`, `created_at`, `updated_at`, `parent_id`) VALUES ('ftyr', 4554, '2019-09-22 15:11:57.983027', '2019-09-22 15:11:57.983027', 4)
---
  def create
    # parameter is return from method blog_params see below
    @blog = Blog.new(blog_params)

    # respond_to method are referencing response that will be sent to the view
    respond_to do |format|
      # if it was valid & saved than:
      if @blog.save

UPDATE `blogs` SET `blogs`.`blog_name` = 'blog name 3f', `blogs`.`blog_number` = 8, `blogs`.`updated_at` = '2019-09-22 11:16:44.330874' WHERE `blogs`.`id` = 4
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

DELETE FROM `blogs` WHERE `blogs`.`id` = 6
---
  def destroy
    @blog.destroy

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`parent_id` = 10 ORDER BY `blogs`.`id` DESC LIMIT 1
SELECT `parents`.* FROM `parents` ORDER BY `parents`.`id` DESC LIMIT 1
---
  def custom_methods_from_model
    @classic_method = Blog.static_method_from_model
    @scope = Blog.scope_blogs_by_name
    @scopeid = Blog.scope_blogs_by_parent_id(Parent.last.id)