9 projects rubymine/RubyOnRails_Testing3/app/controllers/books_controller.rb

UPDATE `books` SET `books`.`book_name` = 'book name 2k', `books`.`book_number` = 8, `books`.`updated_at` = '2019-09-22 11:20:07.838801' WHERE `books`.`id` = 3
---
  def update
    respond_to do |format|
      if @book.update(book_params)