9 projects rubymine/RubyOnRails_Testing3/app/controllers/parents_controller.rb

  def index
    @parents = Parent.all
---
SELECT `parents`.* FROM `parents`

  def create
    @parent = Parent.new(parent_params)
    respond_to do |format|
      if @parent.save
---
INSERT INTO `parents` (`parent_name`, `parent_number`, `created_at`, `updated_at`) VALUES ('klj', 8, '2019-09-22 17:48:54.887912', '2019-09-22 17:48:54.887912')

  def update
    respond_to do |format|
      if @parent.update(parent_params)
---
UPDATE `parents` SET `parents`.`parent_number` = 6, `parents`.`updated_at` = '2019-09-22 11:07:02.001605' WHERE `parents`.`id` = 3

  def destroy
    @parent.destroy
---
DELETE FROM `parents` WHERE `parents`.`id` = 10

  def set_parent
    @parent = Parent.find(params[:id])
---
SELECT `parents`.* FROM `parents` WHERE `parents`.`id` = 21 LIMIT 1