9 projects rubymine/RubyOnRails_Testing3/app/controllers/themes_controller.rb

SELECT `themes`.* FROM `themes`
---
  def index
    @themes = Theme.all

INSERT INTO `themes` (`theme_name`, `theme_number`, `created_at`, `updated_at`) VALUES ('iopi', 8, '2019-09-22 11:19:40.007243', '2019-09-22 11:19:40.007243')
---
  def create
    @theme = Theme.new(theme_params)
    respond_to do |format|
      if @theme.save

UPDATE `themes` SET `themes`.`theme_name` = 'theme name 2k', `themes`.`theme_number` = 9, `themes`.`updated_at` = '2019-09-22 11:19:24.725176' WHERE `themes`.`id` = 3
---
  def update
    respond_to do |format|
      if @theme.update(theme_params)

DELETE FROM `themes` WHERE `themes`.`id` = 7
---
  def destroy
    @theme.destroy

SELECT `themes`.* FROM `themes` WHERE `themes`.`id` = 3 LIMIT 1
---
  def set_theme
    @theme = Theme.find(params[:id])